//--створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

let a =[1,2,3,4,5];
let b =['1','2','3','4','5'];
let c =[false,true,'2',1997,'f'];
console.log(a);
console.log(b);
console.log(c);

//-- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

let aaa = [];
aaa[0] = '1111';
aaa[1] = '2222';
aaa[2] = 3333;
aaa[3] = '4444';
console.log(aaa[0]);
document.write(aaa[3])

//- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

for (let i =0; i < 10; i++){
    document.write(`<div>empty text </div>`);
}
for (let i =0; i < 10; i++){
    document.write('<div>${i}- empty text with index array for</div>');
}
let h1=0;
while (h1<10){
    document.write(`<div>empty text while</div>`);
    h1++
}
let h2=0;
while (h2<10){
    document.write('<div>${h2} - empty text with index array while</div>');
    h2++
}
//- Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
let ff=[0,1,2,3,4,5,6,7,8,9,];
    for (let i =0; i < ff.length; i++){
        console.log(ff[i])
}
//- Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
let gg=['0','1','2','3','4','5','6','7','8','9']
for (let i =0; i < gg.length; i++){
    console.log(gg[i])
}
//- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
let hh=['0',1,'2',false,'4',true,'6',7,'8',9]
for (let i =0; i < hh.length; i++){
    console.log(hh[i])
}
//- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
let jj=['0',1,'2',false,'4',true,'6',7,'8',9]
for (let i =0; i < jj.length; i++) {
    if (typeof jj[i]==='boolean'){
    console.log(jj[i])
    }
}
//- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
let kk=['0',1,'2',false,'4',true,'6',7,'8',9]
for (let i =0; i < kk.length; i++) {
    if (typeof kk[i]==='number'){
        console.log(kk[i])
    }
}
//- Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
let ll=['0',1,'2',false,'4',true,'6',7,'8',9]
for (let i =0; i < ll.length; i++) {
    if (typeof ll[i]==='string'){
        console.log(ll[i])
    }
}
//- Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
let zz=[];
zz[0]='0';
zz[1]=1;
zz[2]='2';
zz[3]=false;
zz[4]='4';
zz[5]=true;
zz[6]='6';
zz[7]=7;
zz[8]='8';
zz[9]=9;
for (let i =0; i < zz.length; i++){
    console.log(zz[i])
}
//- Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
for (let i=0;i<10;i++){
    console.log('поточний крок циклу : ' + i + ' ');
    document.write('поточний крок циклу : ' + i + ' ');
}
//- Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
for (let i=0;i<100;i++){
    console.log('поточний крок циклу : ' + i + ' ');
    document.write('поточний крок циклу : ' + i + ' ');
}
//- Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
for (let i=0;i<100;i+=2){
    console.log('поточний крок циклу : ' + i + ' ');
    document.write('поточний крок циклу : ' + i + ' ');
}
//- Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
for (let i=0;i<100;i++){
    if (i%2===0){
    console.log('поточний крок циклу : ' + i + ' ');
    document.write('поточний крок циклу : ' + i + ' ');
    }
}
//- Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
for (let i=0;i<100;i++){
    if (i%2===1){
        console.log('поточний крок циклу : ' + i + ' ');
        document.write('поточний крок циклу : ' + i + ' ');
    }
}