//- Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.
let first = +prompt('Введіть перше число');
let second = +prompt('Введіть друге число');
if (first > second){
    console.log(first)
}else if (first === second){
    console.log('Введені числа рівні')
}else {
    console.log(second)
}
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let entrance= +prompt("вкажіть номер квартири ");
if (entrance>= 1 && entrance <=20){
    console.log('перший підїзд')
} else if (entrance>= 21 && entrance <=48){
    console.log('другий підїзд')
}else if (entrance>= 49 && entrance <=90) {
    console.log('третій підїзд')
}else{
    console.log('даної квартири не існує')
}
//- Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

let number= +prompt("користувач задає числове значення");
if (number === 10){
    console.log('ВІРНО')
}else {
    console.log('НЕВІРНО')
}
//- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
let xxx =(2);
if (typeof xxx === "number") {
    console.log('це число')
} else if (typeof xxx === "string"){
    console.log('це стрінга')
} else if (typeof xxx === "object"){
    console.log('це обєкт')
} else if (typeof xxx === "boolean"){
    console.log('це булове значення')
} else {
    console.log('взагалі не зрозуміло що ви ввели')
}

// Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let t =prompt('чи ми йдемо сьогодні в OKTEN на навчання?')
if (t<=9){
    console.log('сидимо вдома і вчимося ОНЛАЙН')
}else if (t>=10 && t<=22){
    console.log('ми йдемо ВЧИТИСЯ')
}else if(t>=23){
    console.log('сидимо вдома і вчимося ОНЛАЙН')
}
//- За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//  числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

let  quiz= +prompt('Введіть число від 1 до 5')
switch (quiz) {
    case 1:
        alert('Ваш виграш Автомобіль')
        break;
    case 2:
        alert('Ваш виграш Телефон')
        break;
    case 3:
        alert('Ваш виграш Фен')
        break;
    case 4:
        alert('Ваш виграш 1 гривня')
        break;
    case 5:
        alert('Ваш виграш Кружка')
        break;
    default:
        alert("Ви ввели не те число....ПРОЩАЙТЕ!!!");
}