//- Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.
let first = +prompt('Введіть перше число');
let second = +prompt('Введіть друге число');
if (first > second){
    console.log(first)
}else if (first === second){
    console.log('Введені числа рівні')
}else {
    console.log(second)
}
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.



















